app/Controllers/AdminController.php

    public function index()
    {
        if (!session()->get('logged_in') || session()->get('role') != 'admin') {
            return redirect()->to('/login');
        }

        $model = new SubmissionModel();
        $data['submissions'] = $model->findAll();
---
SELECT *
FROM `submissions`