app/Controllers/SubmissionController.php

    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $model = new SubmissionModel();
        $data['submissions'] = $model->where('user_id', session()->get('id'))->findAll();
---
SELECT *
FROM `submissions`
WHERE `user_id` = '2'

    public function store()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $model = new SubmissionModel();
        $data = [
            'user_id' => session()->get('id'),
            'title' => $this->request->getVar('title'),
            'description' => $this->request->getVar('description'),
            'status' => 'pending'
        ];
        $model->save($data);
---
INSERT INTO `submissions` (`user_id`, `title`, `description`, `status`) VALUES ('2', 'Cuti Tahunan', 'Cuti tahun 2024', 'pending')